RIET/src/InformationRegisters/CustomsFilesOfGoods/CustomsFilesOfGoods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CustomsFilesOfGoods</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </resources>
  <resources>
    <name>DTNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>DTLineNo</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/CustomsFilesOfGoods/RecordSetModule.bsl
Процедура ДобавитьЗапись(Item, CustomsFile=Неопределено, CustomsFileNo, CustomsFileLineNo=Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Item) Тогда
		ВызватьИсключение "Item is empty!";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(CustomsFileNo)) Тогда
		ВызватьИсключение "Customs file no. is empty!";	
	КонецЕсли;
	
	Движение = Добавить();
	Движение.Item = Item;
	Движение.CustomsFile = CustomsFile;
	Движение.DTNo = СокрЛП(CustomsFileNo);
	Движение.DTLineNo = CustomsFileLineNo;
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыБезДополнительныхДанных();
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Запись.DTNo = СокрЛП(Запись.DTNo);
		
	КонецЦикла;
	
КонецПроцедуры
